mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/adc.h
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

/* 
 * File:   
 * Author: 
 * Comments:
 * Revision history: 
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef ADC_HEADER_TEMPLATE_H
#define	ADC_HEADER_TEMPLATE_H

#include <xc.h>
#include <p33FJ128GP802.h> // include processor files - each processor file is guarded.  
#include <dsp.h>

#include <anemometroDef.h>
#include <UART_RTOS.h>

/*FreeRTOS includes*/
#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "list.h"
#include "queue.h"
#include "task.h"
#include "timers.h"
#include "semphr.h"

/*C includes*/
#include <stdint.h>


#define N_DMA_SAMP 128
#define DMA_FREQ 1100000
#define DMA_TOTAL_SAMP 950 //Se debe cumplir: DMA_TOTAL_SAMP >= PWM_SIGNAL_SAMP
#define PWM_SIGNAL_SAMP 911
#define CORR_ZERO (DMA_TOTAL_SAMP + PWM_SIGNAL_SAMP) / 2

void adc_init(void);

void adc_start(void);

void adc_stop(void);

void adc_transdSelect(mux_transSelect_enum transd);

void initDma0(void);

void adc_signalInit(void);

BaseType_t dma_capturePulse(mux_transSelect_enum coordCapture);

BaseType_t dma_detectPulse(mux_transSelect_enum coordDetect, float* time);

BaseType_t dma_ceroAligned(mux_transSelect_enum coordAligned);

BaseType_t dma_ceroCalib(mux_transSelect_enum coordCalib);

#ifdef	__cplusplus
extern "C" {
#endif /* __cplusplus */

    // TODO If C++ is being used, regular C code needs function names to have C 
    // linkage so the functions can be used by the c code. 

#ifdef	__cplusplus
}
#endif /* __cplusplus */

#endif	/* XC_HEADER_TEMPLATE_H */

